app/Services/CryptoService.php

    public function buyCrypto($userId, $symbol, $amount)
    {
        return DB::transaction(function () use ($userId, $symbol, $amount) {
            $user = User::findOrFail($userId);
            $account = $user->account;

            if (!$account) {
                throw new \Exception("User doesn't have an associated account.");
            }

            $cryptoPrice = $this->getCryptoPrice($symbol);
            $totalCost = $amount * $cryptoPrice;

            if ($account->balance < $totalCost) {
                throw new \Exception("Insufficient balance. You need $" . $totalCost . ", but you only have $" . $account->balance);
            }

            $account->balance -= $totalCost;
            $account->save();

            $investment = Investment::firstOrNew([
                'user_id' => $userId,
                'symbol' => $symbol
            ]);

            $newAmount = ($investment->amount ?? 0) + $amount;
            $newTotalCost = (($investment->amount ?? 0) * ($investment->average_buy_price ?? 0)) + $totalCost;
            $investment->amount = $newAmount;
            $investment->average_buy_price = $newTotalCost / $newAmount;

            $investment->save();
---
select * from "accounts" where "accounts"."user_id" = 1 and "accounts"."user_id" is not null limit 1
select * from "users" where "users"."id" = 1 limit 1
select * from "users" where "users"."id" = 10 limit 1
select * from "investments" where ("user_id" = 10 and "symbol" = 'BTC') limit 1
update "investments" set "amount" = 3, "average_buy_price" = 145.70478589571, "updated_at" = '2024-08-18 15:42:48' where "id" = 3

    public function sellCrypto($userId, $symbol, $amount)
    {
        return DB::transaction(function () use ($userId, $symbol, $amount) {
            $user = User::findOrFail($userId);
            $account = $user->account;

            if (!$account) {
                throw new \Exception("User doesn't have an associated account.");
            }

            $investment = Investment::where('user_id', $userId)
                ->where('symbol', $symbol)
                ->firstOrFail();

            if ($investment->amount < $amount) {
                throw new \Exception('Insufficient cryptocurrency balance');
            }

            $cryptoPrice = $this->getCryptoPrice($symbol);
            $totalValue = $amount * $cryptoPrice;

            $account->balance += $totalValue;
            $account->save();
---
insert into "investments" ("user_id", "symbol", "amount", "average_buy_price", "updated_at", "created_at") values (1, 'DAI', 5.0E-8, 0.99997379354636, '2024-08-18 16:26:55', '2024-08-18 16:26:55')
update "accounts" set "balance" = 1149.3168887817, "updated_at" = '2024-08-15 21:57:41' where "id" = 1