app/Services/TransactionService.php

    public function transfer($fromAccountId, $toAccountId, $amount, $currency)
    {
        return DB::transaction(function () use ($fromAccountId, $toAccountId, $amount, $currency) {
            $fromAccount = Account::findOrFail($fromAccountId);
            $toAccount = Account::findOrFail($toAccountId);

            // Add currency conversion logic here if needed
            $convertedAmount = $this->convertCurrency($amount, $currency, $fromAccount->currency);

            if ($fromAccount->balance < $convertedAmount) {
                throw new \Exception('Insufficient funds');
            }

            $fromAccount->balance -= $convertedAmount;
            $toAccount->balance += $amount;

            $fromAccount->save();
            $toAccount->save();
---
update "accounts" set "balance" = 340.98277870085, "updated_at" = '2024-08-18 16:08:00' where "id" = 1
update "accounts" set "balance" = 1100, "updated_at" = '2024-08-18 16:08:00' where "id" = 2