app/Http/Controllers/CryptocurrencyController.php

select * from "investments" where "user_id" = 1
---
    public function index(): View|Factory|Application
    {
        $cryptocurrencies = $this->getCachedCryptocurrencies();

        $userInvestments = Investment::where('user_id', Auth::id())->get()->keyBy('symbol');