app/Http/Controllers/CurrencySwitchController.php

    public function switch(Request $request): RedirectResponse
    {
        $request->validate([
            'currency' => 'required|string|size:3',
        ]);

        $user = $request->user();
        $account = $user->account;
        $newCurrency = $request->currency;

        $convertedBalance = $this->currencyService->convert(
            $account->balance,
            $account->currency,
            $newCurrency
        );

        $account->update([
            'balance' => $convertedBalance,
            'currency' => $newCurrency,
        ]);
---
update "accounts" set "balance" = 907.09816, "currency" = 'EUR', "updated_at" = '2024-08-18 22:07:34' where "id" = 3