app/Http/Controllers/DashboardController.php

select * from "transactions" where "from_account_id" = 2 or "to_account_id" = 2 order by "created_at" desc limit 10
select * from "currencies"
select * from "crypto_transactions" where "from_account_id" = 1 or "to_account_id" = 1 order by "created_at" desc limit 10
---
    public function index(Request $request): View|Factory|Application
    {
        $user = $request->user();
        $account = $user->account;
        $transactions = Transaction::where('from_account_id', $account->id)
            ->orWhere('to_account_id', $account->id)
            ->latest()
            ->take(10)
            ->get();

        $currencies = Currency::all();

        $cryptoTransactions = CryptoTransaction::where('from_account_id', $account->id)
            ->orWhere('to_account_id', $account->id)
            ->latest()
            ->take(10)
            ->get();