app/Http/Controllers/InvestmentController.php

    public function index(): View|Factory|Application
    {
        $user = Auth::user();
        $investments = $user->investments()->get();
---
select * from "investments" where "investments"."user_id" = 2 and "investments"."user_id" is not null