app/Http/Controllers/TransactionsController.php

    public function transfer(TransferRequest $request): RedirectResponse
    {
        try {
            $fromAccount = $request->user()->account;
            $toAccount = Account::where('iban', $request->to_account_iban)->firstOrFail();
---
select * from "accounts" where "iban" = 'LT234567890123456789' limit 1