app/Models/Account.php

select * from "accounts" where "accounts"."id" = 2 limit 1
---
    public static function findOrFail($id)
    {
        return static::query()->findOrFail($id);