app/Models/Transaction.php

    public static function create(array $attributes = [])
    {
        return static::query()->create($attributes);
---
insert into "transactions" ("from_account_id", "to_account_id", "amount", "currency", "updated_at", "created_at") values (1, 2, '100', 'USD', '2024-08-18 16:08:00', '2024-08-18 16:08:00')